In [1]:
import pandas as pd

Q1. **Goal of the Dataset:** GDP per capita and life expectancy

In [2]:
df = pd.read_csv("mckinsey.csv")
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [4]:
df.describe()

             year    population     life_exp        gdp_cap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165876
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846988
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [5]:
df.describe(include="object")

            country continent
count          1704      1704
unique          142         5
top     Afghanistan    Africa
freq             12       624

Work with Columns

In [6]:
df["country"].value_counts() #output is series

Afghanistan          12
Pakistan             12
New Zealand          12
Nicaragua            12
Niger                12
                     ..
Eritrea              12
Equatorial Guinea    12
El Salvador          12
Egypt                12
Zimbabwe             12
Name: country, Length: 142, dtype: int64

In [7]:
type(df["country"].value_counts()) #here we have two values

pandas.core.series.Series

In [8]:
df["country"].value_counts().index #index can be non-numeric

Index(['Afghanistan', 'Pakistan', 'New Zealand', 'Nicaragua', 'Niger',
       'Nigeria', 'Norway', 'Oman', 'Panama', 'Nepal',
       ...
       'Gambia', 'Gabon', 'France', 'Finland', 'Ethiopia', 'Eritrea',
       'Equatorial Guinea', 'El Salvador', 'Egypt', 'Zimbabwe'],
      dtype='object', length=142)

Rename the column name

In [9]:
df.rename({'country':"Country"}, axis=1, inplace=True)

In [10]:
df

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [11]:
#may be column name contain space
#my be column name contain number
#may be shape is the column name which is predefine variable

In [12]:
df.drop(["Country"], axis=1)

      year  population continent  life_exp     gdp_cap
0     1952     8425333      Asia    28.801  779.445314
1     1957     9240934      Asia    30.332  820.853030
2     1962    10267083      Asia    31.997  853.100710
3     1967    11537966      Asia    34.020  836.197138
4     1972    13079460      Asia    36.088  739.981106
...    ...         ...       ...       ...         ...
1699  1987     9216418    Africa    62.351  706.157306
1700  1992    10704340    Africa    60.377  693.420786
1701  1997    11404948    Africa    46.809  792.449960
1702  2002    11926563    Africa    39.989  672.038623
1703  2007    12311143    Africa    43.487  469.709298

[1704 rows x 5 columns]

In [13]:
df['custom'] = [i for i in range(1704)]
df

          Country  year  population continent  life_exp     gdp_cap  custom
0     Afghanistan  1952     8425333      Asia    28.801  779.445314       0
1     Afghanistan  1957     9240934      Asia    30.332  820.853030       1
2     Afghanistan  1962    10267083      Asia    31.997  853.100710       2
3     Afghanistan  1967    11537966      Asia    34.020  836.197138       3
4     Afghanistan  1972    13079460      Asia    36.088  739.981106       4
...           ...   ...         ...       ...       ...         ...     ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306    1699
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786    1700
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960    1701
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623    1702
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298    1703

[1704 rows x 7 columns]

In [14]:
df.drop(['custom'], axis=1, inplace=True)
df

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

Working with row

In [15]:
ser = df['Country']
ser

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: Country, Length: 1704, dtype: object

In [16]:
ser[3]

'Afghanistan'

In [17]:
ser[4:16] #Slicing
df['Country'][4:16]

4     Afghanistan
5     Afghanistan
6     Afghanistan
7     Afghanistan
8     Afghanistan
9     Afghanistan
10    Afghanistan
11    Afghanistan
12        Albania
13        Albania
14        Albania
15        Albania
Name: Country, dtype: object

In [18]:
ser.index

RangeIndex(start=0, stop=1704, step=1)

In [19]:
import numpy as np
ser.index = np.arange(1, df.shape[0]+1, 1)
ser

1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
5       Afghanistan
           ...
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
1704       Zimbabwe
Name: Country, Length: 1704, dtype: object

positional indexes - implicit indexes, always Start from 0 and end with number<br>
visible indexes -  explicit indexes, any indexes

In [20]:
ser.index

Int64Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
            ...
            1695, 1696, 1697, 1698, 1699, 1700, 1701, 1702, 1703, 1704],
           dtype='int64', length=1704)

In [21]:
data = pd.Series(['a','b','c'], index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [22]:
#indexing
data[1], data[3] #using explicit indexes

('a', 'b')

In [23]:
#slicing
data[1:3] #unsing implicit indexing

C:\Users\visha\AppData\Local\Temp\ipykernel_10516\1623602752.py:2: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  data[1:3] #unsing implicit indexing

3    b
5    c
dtype: object

In [24]:
data = pd.Series(['a','b','c'], index=["x", "y", "z"])
data

x    a
y    b
z    c
dtype: object

In [25]:
data['x'] #indexing using positinal indexing

'a'

In [26]:
#to Avoid the confusion Pandas has Special Indexes
#1. loc - work with explicit indexes/labels <br>
#2. iloc - works with implicit indexes/posistional indexes

In [27]:
data.loc["x"], data.iloc[0]

('a', 'a')

In [28]:
data.loc["y"], data.iloc[1]

('b', 'b')

In [29]:
data.loc["z"], data.iloc[2]

('c', 'c')

In [31]:
df.iloc[[1,10,100]]

         Country  year  population continent  life_exp     gdp_cap
1    Afghanistan  1957     9240934      Asia    30.332  820.853030
10   Afghanistan  2002    25268405      Asia    42.129  726.734055
100   Bangladesh  1972    70759295      Asia    45.252  630.233627

In [33]:
df.loc[[1,10,100]] #indexes is same that is why answer is same for loc and iloc

         Country  year  population continent  life_exp     gdp_cap
1    Afghanistan  1957     9240934      Asia    30.332  820.853030
10   Afghanistan  2002    25268405      Asia    42.129  726.734055
100   Bangladesh  1972    70759295      Asia    45.252  630.233627

In [37]:
df.iloc[-1] #implicit location
#df.loc[-1] gives error

Country         Zimbabwe
year                2007
population      12311143
continent         Africa
life_exp          43.487
gdp_cap       469.709298
Name: 1703, dtype: object

In [39]:
#convert country to indexd/row label
temp = df.set_index("Country")
temp.head(3)

             year  population continent  life_exp     gdp_cap
Country
Afghanistan  1952     8425333      Asia    28.801  779.445314
Afghanistan  1957     9240934      Asia    30.332  820.853030
Afghanistan  1962    10267083      Asia    31.997  853.100710

In [40]:
temp.loc["Afghanistan"]

             year  population continent  life_exp     gdp_cap
Country
Afghanistan  1952     8425333      Asia    28.801  779.445314
Afghanistan  1957     9240934      Asia    30.332  820.853030
Afghanistan  1962    10267083      Asia    31.997  853.100710
Afghanistan  1967    11537966      Asia    34.020  836.197138
Afghanistan  1972    13079460      Asia    36.088  739.981106
Afghanistan  1977    14880372      Asia    38.438  786.113360
Afghanistan  1982    12881816      Asia    39.854  978.011439
Afghanistan  1987    13867957      Asia    40.822  852.395945
Afghanistan  1992    16317921      Asia    41.674  649.341395
Afghanistan  1997    22227415      Asia    41.763  635.341351
Afghanistan  2002    25268405      Asia    42.129  726.734055
Afghanistan  2007    31889923      Asia    43.828  974.580338

In [43]:
temp.iloc[:12]

             year  population continent  life_exp     gdp_cap
Country
Afghanistan  1952     8425333      Asia    28.801  779.445314
Afghanistan  1957     9240934      Asia    30.332  820.853030
Afghanistan  1962    10267083      Asia    31.997  853.100710
Afghanistan  1967    11537966      Asia    34.020  836.197138
Afghanistan  1972    13079460      Asia    36.088  739.981106
Afghanistan  1977    14880372      Asia    38.438  786.113360
Afghanistan  1982    12881816      Asia    39.854  978.011439
Afghanistan  1987    13867957      Asia    40.822  852.395945
Afghanistan  1992    16317921      Asia    41.674  649.341395
Afghanistan  1997    22227415      Asia    41.763  635.341351
Afghanistan  2002    25268405      Asia    42.129  726.734055
Afghanistan  2007    31889923      Asia    43.828  974.580338

In [45]:
temp["life_exp"].loc["Zimbabwe"]

Country
Zimbabwe    48.451
Zimbabwe    50.469
Zimbabwe    52.358
Zimbabwe    53.995
Zimbabwe    55.635
Zimbabwe    57.674
Zimbabwe    60.363
Zimbabwe    62.351
Zimbabwe    60.377
Zimbabwe    46.809
Zimbabwe    39.989
Zimbabwe    43.487
Name: life_exp, dtype: float64

In [47]:
d = {'Country':'India', 'year':2023, 'population':1.5, 'continent':'Asia', 'life_exp':75, 'gdp_cap':200}
d

{'Country': 'India',
 'year': 2023,
 'population': 1.5,
 'continent': 'Asia',
 'life_exp': 75,
 'gdp_cap': 200}

In [49]:
df.append(d, ignore_index=True) #ignore the index of d.

C:\Users\visha\AppData\Local\Temp\ipykernel_10516\3662875788.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(d, ignore_index=True)

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952   8425333.0      Asia    28.801  779.445314
1     Afghanistan  1957   9240934.0      Asia    30.332  820.853030
2     Afghanistan  1962  10267083.0      Asia    31.997  853.100710
3     Afghanistan  1967  11537966.0      Asia    34.020  836.197138
4     Afghanistan  1972  13079460.0      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1700     Zimbabwe  1992  10704340.0    Africa    60.377  693.420786
1701     Zimbabwe  1997  11404948.0    Africa    46.809  792.449960
1702     Zimbabwe  2002  11926563.0    Africa    39.989  672.038623
1703     Zimbabwe  2007  12311143.0    Africa    43.487  469.709298
1704        India  2023         1.5      Asia    75.000  200.000000

[1705 rows x 6 columns]

In [57]:
df.loc[len(df.index)] = ["India", 2022, 1350000, "Asia", 75, 500]  #iloc will not add the value

In [58]:
df

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298
1704        India  2022     1350000      Asia    75.000  500.000000
1705        India  2022     1350000      Asia    75.000  500.000000
1706        India  2022     1350000      Asia    75.000  500.000000

[1707 rows x 6 columns]

**Drop Rows**

In [61]:
df.loc[df.duplicated()]

     Country  year  population continent  life_exp  gdp_cap
1705   India  2022     1350000      Asia      75.0    500.0
1706   India  2022     1350000      Asia      75.0    500.0

In [64]:
df.drop_duplicates(keep="first")

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298
1704        India  2022     1350000      Asia    75.000  500.000000

[1705 rows x 6 columns]

In [67]:
df.drop([1706], axis=0, inplace=True)

**Work with Rows and Columns: Slicing**

In [69]:
df.iloc[1:5, :4]

       Country  year  population continent
1  Afghanistan  1957     9240934      Asia
2  Afghanistan  1962    10267083      Asia
3  Afghanistan  1967    11537966      Asia
4  Afghanistan  1972    13079460      Asia

In [77]:
df.iloc[[0,10,100],[0,1,2]]

         Country  year  population
0    Afghanistan  1952     8425333
10   Afghanistan  2002    25268405
100   Bangladesh  1972    70759295

In [70]:
df.head(3)

       Country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710

In [76]:
df.loc[1:5, "Country":"life_exp"]  #5 ia also included

       Country  year  population continent  life_exp
1  Afghanistan  1957     9240934      Asia    30.332
2  Afghanistan  1962    10267083      Asia    31.997
3  Afghanistan  1967    11537966      Asia    34.020
4  Afghanistan  1972    13079460      Asia    36.088
5  Afghanistan  1977    14880372      Asia    38.438

In [79]:
print(df['life_exp'].mean())
print(df['life_exp'].sum())
print(df['life_exp'].count())

59.49264049237983
101494.44467999999
1706

In [84]:
df.sort_values(["year"], ascending=False)

             Country  year  population continent  life_exp       gdp_cap
1705           India  2022     1350000      Asia    75.000    500.000000
1704           India  2022     1350000      Asia    75.000    500.000000
1523        Tanzania  2007    38139640    Africa    52.517   1107.482182
755          Ireland  2007     4109086    Europe    78.885  40675.996350
1451           Sudan  2007    42292929    Africa    58.556   2602.394995
...              ...   ...         ...       ...       ...           ...
612           Guinea  1952     2664249    Africa    33.609    510.196492
1596  United Kingdom  1952    50430000    Europe    69.180   9979.508487
1164        Pakistan  1952    41346560      Asia    43.436    684.597144
600        Guatemala  1952     3146381  Americas    42.023   2428.237769
0        Afghanistan  1952     8425333      Asia    28.801    779.445314

[1706 rows x 6 columns]

In [86]:
df.sort_values(["year", "life_exp"], ascending=[False, True])

          Country  year  population continent  life_exp       gdp_cap
1704        India  2022     1350000      Asia    75.000    500.000000
1705        India  2022     1350000      Asia    75.000    500.000000
1463    Swaziland  2007     1133066    Africa    39.613   4513.480643
1043   Mozambique  2007    19951656    Africa    42.082    823.685621
1691       Zambia  2007    11746035    Africa    42.384   1271.211593
...           ...   ...         ...       ...       ...           ...
408       Denmark  1952     4334000    Europe    70.780   9692.385245
1464       Sweden  1952     7124673    Europe    71.860   8527.844662
1080  Netherlands  1952    10381988    Europe    72.130   8941.571858
684       Iceland  1952      147962    Europe    72.490   7267.688428
1140       Norway  1952     3327728    Europe    72.670  10095.421720

[1706 rows x 6 columns]

In [87]:
#Create a Series
pd.Series([10,20,30], index=["a","b","c"])

a    10
b    20
c    30
dtype: int64

In [88]:
#Create Dataframe
#1 - Row Oriented
pd.DataFrame([[10,20], [30,40]], columns=["A", "B"])

    A   B
0  10  20
1  30  40

In [89]:
#2. Column Orriented Approch
pd.DataFrame({"A":[10,20], "B":[30,40]})

    A   B
0  10  30
1  20  40